html/game.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-03-26 Sat 22:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Play games using lazy trees</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Hsin-Hao Yu" />
<link rel="stylesheet" type="text/css" href="https://gongzhitaao.org/orgcss/org.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Play games using lazy trees</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7f65cae">1. Build a (lazy) game tree</a></li>
<li><a href="#org0f0c73d">2. Prune the game tree</a></li>
<li><a href="#orgeccac35">3. Static evaluation</a></li>
<li><a href="#orgc8484fe">4. Minimax (using mutually recursive functions)</a></li>
<li><a href="#org227e20b">5. A slight modification</a></li>
<li><a href="#org89893b9">6. Alpha-beta pruning (using iterators of iterators)</a></li>
<li><a href="#org66ecb2b">7. Alpha-beta utilities</a></li>
<li><a href="#org46f6a52">8. Appendix: Imports</a></li>
</ul>
</div>
</div>
<p>
In this chapter, we will apply the ideas developed so far to a more complicated problem: playing a two-player game. We'll develop the game AI code here, and then we'll use them to play Tic-tac-toe in the .
</p>

<div id="outline-container-org7f65cae" class="outline-2">
<h2 id="org7f65cae"><span class="section-number-2">1</span> Build a (lazy) game tree</h2>
<div class="outline-text-2" id="text-1">
<p>
Remember that <code>repeat_f</code> (defined ) repeatedly applies a function to an initial value to generate a list. Let's extend the idea to trees. Let <code>f</code> be a function that takes a value, and returns a list of values. We define <code>reptree</code> to grows a tree out of an initial value by applying <code>f</code> repeatedly. Recall that tree is represented by <code>Node</code> defined in the . 
</p>
<div class="org-src-container">
<pre class="src src-python">def reptree(f: Callable[[Any], Optional[Iterator[Any]]], label: Any) -&gt; Node:
    """Appy a function f to a label repeatedly to create a tree.
    f(label) is a list of labels
    """
    def make_children(lst):
	if lst is None:
	    # f produces nothing
	    return None
	else:
	    # else, apply f repeatedly to elements of lst
	    return map(lambda b: reptree(f, b), lst)

    return Node(label, make_children(f(label)))
</pre>
</div>

<p>
For playing games, we represent the rules of the game in a function called <code>moves</code>. This function takes a initial state of the game board, and returns an iterator of board configurations corresponding to all legal moves (see for a concrete example). By applying <code>moves</code> repeatedly to an initial board configuration, we get a tree of all possible future configurations of the game! Remember that <code>reptree</code> is lazy, so this large tree has not been created yet at this point. The future configurations will only be computed when they are needed.
</p>
<div class="org-src-container">
<pre class="src src-python">&lt;&lt;GAME_IMPORTS&gt;&gt;

# Board is a type alias for representing a board configuration.
# In this example,  it's just a list
Board = List

&lt;&lt;GAME_UTILS&gt;&gt;

def gametree(moves: Callable[[Board], Optional[Iterator[Board]]]) -&gt; Callable[[Board], Node]:
    """Return a func that builds a gametree from an initial board.
    moves is a function that returns all legal moves given a board.
    """
    def gametree_(board: Board) -&gt; Node:
	return reptree(moves, board)
    return gametree_
</pre>
</div>

<p>
The code above defines a <code>gametree</code> as "factory function", which receives <code>moves</code> and returns a closure that only needs the initial board configuration as its input. This way, it's easier to customized it for a specific game.
</p>
</div>
</div>

<div id="outline-container-org0f0c73d" class="outline-2">
<h2 id="org0f0c73d"><span class="section-number-2">2</span> Prune the game tree</h2>
<div class="outline-text-2" id="text-2">
<p>
To find the best next move, searching the entire game tree is typically impractical. We can reduce the size of the search space by limiting the game AI to looks ahead for only a fixed number of moves. The <code>prune</code> function does this by removing nodes after a certain depth (<code>n</code>). 
</p>
<div class="org-src-container">
<pre class="src src-python">def prune(n: int, tree: Node) -&gt; Node:
    """Remove nodes n levels below in the tree"""
    (board, subtrees) = tree

    if n == 0:
	return Node(board, None)
    elif subtrees is None:
	return Node(board, None)
    else:
	return Node(board, map(lambda t: prune(n - 1, t), subtrees))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeccac35" class="outline-2">
<h2 id="orgeccac35"><span class="section-number-2">3</span> Static evaluation</h2>
<div class="outline-text-2" id="text-3">
<p>
To play games, we need a static evaluation function to score each board configuration with a value, in order to guide the selection of the next move. This function does not take future moves into account, so it's not good enough for making the next move. But it's a good starting point.
</p>

<p>
The customizes the code above to play Tic-tac-toe: <code>init_board</code> creates an empty game board, <code>gametree</code> creates a game tree, <code>prune</code> prunes a tree, and <code>static_eval(0)</code> scores a board configuration with a static evaluation function for player 0. The statement below replaces the labels in the game tree with the static scores. There is another function that keeps the board configuration and the score.
</p>
<div class="org-src-container">
<pre class="src src-python">maptree(static_eval(0), prune(gametree(init_board())))
</pre>
</div>

<p>
Recall that <code>maptree</code> was defined in a the .
</p>
</div>
</div>

<div id="outline-container-orgc8484fe" class="outline-2">
<h2 id="orgc8484fe"><span class="section-number-2">4</span> Minimax (using mutually recursive functions)</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://en.wikipedia.org/wiki/Minimax">Minimax</a> is an algorithm for playing zero-sum two-player games. If a computer plays against a human opponent, Minimax selects the computer's best move in two steps: For every legal move that the computer can make, find the worst that the human can do to the computer in a follow-up move (this is the "min" step). Then take the move that is associated with the best outcome for the computer (the "max" step). But how does the computer know what's the worst that the human can do to it? It's the other side of the coin: It's the human's best move against the computer future moves. It's not hard to see that Minimax is naturally expressed as a pair of mutually recursive functions:
</p>
<div class="org-src-container">
<pre class="src src-python">def maximize1(gametree: Node) -&gt; int:
    """The max step of Minimax"""
    (score, subtrees) = gametree

    if subtrees is None:
	s = score
    else:
	s = max(map(minimize1, subtrees))
    return s

def minimize1(gametree: Node) -&gt; int:
    """The min step of Minimax.
    A node in gametree is ((board, score), subtrees)
    Returns (board, score) with the minimal score
    """    
    (score, subtrees) = gametree

    if subtrees is None:
	s = score
    else:
	s = min(map(maximize1, subtrees))
    return s
</pre>
</div>

<p>
The code below is the first version of our tree evaluation function. The code is easy to read, because it's a chain of functions: given a board configuration, creates a game tree of all possible configurations, prune it to limit the search to a fixed steps ahead, apply the static evaluation to all the nodes, and then uses Minimax to return a score. Note that all the functions in the chain are lazy. Although the code reads like pruning, scoring, and minimaxing apply to the whole tree, only the parts that are needed will be evaluated.
</p>
<div class="org-src-container">
<pre class="src src-python">def evaluate1(gametree_: Callable[[Board], Node], static_eval_: Callable[[Board], int], prune_: Callable[[Node], Node]) -&gt; Callable[[Board], int]:
    """Return a tree evaluation function"""
    def evaluate_(board: Board) -&gt; int:
	return maximize1(maptree(static_eval_, prune_(gametree_(board))))
    return evaluate_
</pre>
</div>
</div>
</div>

<div id="outline-container-org227e20b" class="outline-2">
<h2 id="org227e20b"><span class="section-number-2">5</span> A slight modification</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-python">def maximize2_(gametree: Node) -&gt; int:
    """The max step of Minimax"""
    (score, subtrees) = gametree

    if subtrees is None:
	s = score
    else:
	s = map(minimize1, subtrees)
    return s

def minimize2_(gametree: Node) -&gt; int:
    """The min step of Minimax.
    A node in gametree is ((board, score), subtrees)
    Returns (board, score) with the minimal score
    """    
    (score, subtrees) = gametree

    if subtrees is None:
	s = score
    else:
	s = map(maximize1, subtrees)
    return s
</pre>
</div>
</div>
</div>

<div id="outline-container-org89893b9" class="outline-2">
<h2 id="org89893b9"><span class="section-number-2">6</span> Alpha-beta pruning (using iterators of iterators)</h2>
<div class="outline-text-2" id="text-6">
<p>
In the previous section, the tree evaluation function uses the lazy tree is efficient: because only a segment of the tree is needed at a time, the entire tree doesn't need to be stored in memory. Once a branch has been evaluated, it can be garbage collected immediately. However, Minimax does need to visit every node in the tree. Is there a way to prevent Minimax from visiting branches that are obviously not promising?
</p>

<p>
The answer is yes. The trick is a pair of functions called <code>mapmin</code> and <code>mapmax</code>. I'll only describe what they do. The code is in the end of this chapter. <code>mapmin</code> is just like <code>map(min(...))</code>, except that it skips some unnecessary computation. How is it possible to skip any computation? Take this example: [[1, 2], [0, X]]. Following the logic of Minimax, we need the max of the min of the two sublists. The min of [1, 2] is 1. When we get to [0, X], we don't know the min, because X is unknown. However, we know that min([0, X])&lt;=0. That means no matter what X is, min([0, X]) cannot be larger than the current max (which is 1). X therefore doesn't matter in the calculation of the max. If evaluation X is computationally demanding, this saves time.
</p>

<div class="org-src-container">
<pre class="src src-python">&lt;&lt;ALPHA_BETA_UTILS&gt;&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org66ecb2b" class="outline-2">
<h2 id="org66ecb2b"><span class="section-number-2">7</span> Alpha-beta utilities</h2>
<div class="outline-text-2" id="text-7">
<p>
To implement <code>mapmin</code>, we begin with <code>minleq</code>. Given an iterator <code>seq</code> and a "potential max" <code>mx</code>, <code>minleq(seq, mx)</code> returns if the iterator can be "omitted". For example, the following statement returns True.
</p>
<div class="org-src-container">
<pre class="src src-python">minleq(iter([3, 2, 5, 30, 1, 6]), 20)
</pre>
</div>

<p>
<code>minleq(itr, 20)</code> is looking for a value greater than 20. The first value of <code>itr</code> is 3, which means that the minimum of <code>itr</code> is not big enough to replace 20 as the potential maximum. The rest of the iterator therefore does not need to be evaluated further. The returned value <code>True</code> indicates that this sequence is to be omitted. In the context of games, this is not a move that needs to be considered further, because the first counter-move we consider is already pretty bad (3), It's true that the 4th counter-move can be very good for us (30), but we can't count on the opponent making a blunder, can we?
</p>

<p>
The following statement, however, returns 1.
</p>
<div class="org-src-container">
<pre class="src src-python">minleq(iter([3, 2, 5, 30, 1, 6]), 0)
</pre>
</div>

<p>
This sequence cannot be omitted because all numbers are larger than the potential max. In that case, the minimum (1) is return. In the context of games, this move is stronger than what had been considered before, because no matter what the counter-move is, we always end up in a better position.
</p>

<p>
Here's the code. See for more examples.
</p>
<div class="org-src-container">
<pre class="src src-python">def mk_ab_seq(comp: Callable, op: Callable) -&gt; Callable:
    """Given a comparison function comp and an operator op, return a function."""
    def ab_seq(seq: Optional[Iterator], pot: int) -&gt; Optional[Union[int, bool]]:
	"""Efficient min/max of an iterator, given potential max/min"""
	def ab_seq_(seq, current_val):
	    try:
		i = next(seq)
		if current_val is None:
		    current_val = i

		if comp(i, pot):
		    # if smaller, returns true immediately
		    return True
		else:
		    return ab_seq_(seq, op(i, current_val))
	    except StopIteration:
		if current_val is None:
		    return pot
		else:
		    return current_val

	if seq is None:
	    return pot
	else:
	    return ab_seq_(seq, None)

    return ab_seq

minleq = mk_ab_seq(operator.le, min)
minleq.__doc__ = """
Return min of seq if it's &gt; potential max.
Else return True"""

maxgeq = mk_ab_seq(operator.ge, max)
maxgeq.__doc__ = """
Return max of seq if it's &lt; potential min.
Else return True"""
</pre>
</div>

<p>
With <code>minleq</code>, we can write <code>mapmin</code>. It takes a iterators of sub-iterators, and return the minima of the sub-iterators, omitting the sub-iterators that don't matter. For example, the following code returns [1, 3]. Note that it is an increasing sequence.
</p>
<div class="org-src-container">
<pre class="src src-python">seqs = iter([iter([1, 2]), iter([0, 10]), iter([3, 20]), iter([1, 100])])
list(mapmin(seqs))
</pre>
</div>

<p>
Here's the implementation:
</p>
<div class="org-src-container">
<pre class="src src-python">def mapmin(seqs: Iterator[Iterator]) -&gt; Iterator:
    """Like map(min, seqs)
    But skip those that don't matter for max.
    The sequence increases monotonically
    """
    try:
	seq = next(seqs)
	mn = min(seq)
	yield mn
	for i in omit_max(mn, seqs):
	    yield i
    except StopIteration:
	pass

def mapmax(seqs: Iterator[Iterator]) -&gt; Iterator:
    """Like map(max, seqs)
    But skip those that don't matter for min
    The sequence decreases monotonically
    """
    try:
	seq = next(seqs)
	mx = max(seq)
	yield mx
	for i in omit_min(mx, seqs):
	    yield i
    except StopIteration:
	pass

def mk_omit(skip_func: Callable) -&gt; Callable:
    """The skip function is either minleq or maxgeq"""
    def omit_(pot: int, seqs: Optional[Iterator[Iterator[int]]]) -&gt; Iterator[Optional[int]]:
	"""Given an iterator of iterators, call skip_func.
	If the returned value is true, skip it. Otherwise, yield the value
	"""
	for seq in seqs:
	    m = skip_func(seq, pot)
	    if m is True:
		for i in omit_(pot, seqs):
		    yield i
	    else:
		yield m
		for i in omit_(m, seqs):
		    yield i

    return omit_

omit_max = mk_omit(minleq)
omit_max.__doc__ = """
Given an initial potential max, return the min of subsequences.
Skip those that don't matter. Sequence increases.
"""

omit_min = mk_omit(maxgeq)
omit_max.__doc__ = """
Given an initial potental min, return the max of subsequences.
Skip those that don't matter. Sequence decreases.
"""
</pre>
</div>

<p>
<code>mapmin</code>, <code>omit_max</code> and <code>minleq</code> are for the max step. Similarly, <code>mapmax</code>, <code>omit_min</code> and <code>maxgeq</code> are for the min step. 
</p>
</div>
</div>

<div id="outline-container-org46f6a52" class="outline-2">
<h2 id="org46f6a52"><span class="section-number-2">8</span> Appendix: Imports</h2>
<div class="outline-text-2" id="text-8">
<div class="org-src-container">
<pre class="src src-python">from functools import reduce
from typing import Callable, List, Iterator, Tuple, Optional, Union
from lazy_utils import reptree, maptree, Node
import operator
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">from typing import Callable, Optional, Iterator, Union
import operator
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Hsin-Hao Yu</p>
<p class="date">Created: 2022-03-26 Sat 22:38</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
